---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportView
source: html/dcb5c042-6ce3-b2bf-bd46-70192595b1cf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportView Property

"View"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportView { get; }
```